org/sensetime/2020.org
#+TITLE: 2020 年度规划

* Q3规划

** 产品功能迭代开发
在现有工作基础上，收集客户反馈和需求。
进行新功能开发和已有功能改进优化。
- IAM
  - 统一登出
  - 第三方帐号登录
  - 现有功能改进和优化
    - UI
    - Benckend
    - DevOps

- API gateway
  - 流量控制
  - API访问日志
  - kong和插件的版本升级迁移

- license
  - 加密算法升级
  - license SDK 支持动态链接库的集成方式

** 产品推广以及和业务线集成
和业务线紧密合作，推动产品线和商汤云框架的对接和集成, 加速商汤云框架的落地和应用。
包含但不限于以下产品线
- Evoa
- Sensestudio
- SenselinkGE
- Sensecare

为了提高集成的效率和质量
- 完善对接流程文档
- 提供类生产环境的集成环境和示例应用
- 提供测试验证工具

** 产品部署交付
商汤云框架的部署交付。根据实际需求排期，会在下面的区域进行IAM/API Gateway的部署实施。
- SkyICT
- JCV

为了提高部署的效率和后续运维质量，
- 完善日志和监控报警定义
- 提供自动巡检功能
- 版本升级，数据迁移技术验证和演练


** 内部集成优化

- 商汤云框架和license系统之间的集成方式

* Q3 WorkItem
** IAM
*** 新功能
统一登出
第三方帐号登录
log metrics

*** 已有功能改进
**** 用户管理

**** rs管理
- WebUI: 配置管理

- OpenAPI: CRUD
  - 创建：
    baseurl
    internal_url

    baseurl 的格式必须固定，并且和yaml的版本号一致

  - 更新
    哪些字段能够更新？？！！ 只能更新openapi.yaml

  - 删除
    没有access key
    并且gateway被undeploy了

**** metrics 定义和收集
cache

** API Gateway
*** Nginx和Openresty的原理机制
*** Kong插件开发流程
*** kong docker image 打包过程和配置

*** 常见组件
nokia-oidc
openidc
session
redis-cluster


** DevOps
Build
Release
Run
