org/sensetime/2020.html
<!doctype html>
<html lang="en">
<head>
<title>2020 年度规划</title>
<<<<<<< HEAD
<!-- 2020-07-06 Mon 11:02 -->
=======
<!-- 2020-07-04 Sat 14:44 -->
>>>>>>> 50fef871450b68c27b650ddc17389c7f974a1e49
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="zhou mingjun">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Q3规划</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. 产品功能迭代开发</a></li>
<li><a href="#sec-1-2">1.2. 产品推广以及和业务线集成</a></li>
<li><a href="#sec-1-3">1.3. 产品部署交付</a></li>
<li><a href="#sec-1-4">1.4. 内部集成优化</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Q3 WorkItem</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. IAM</a></li>
<li><a href="#sec-2-2">2.2. API Gateway</a></li>
<li><a href="#sec-2-3">2.3. DevOps</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">2020 年度规划</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Q3规划</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 产品功能迭代开发</h3>
<div class="outline-text-3" id="text-1-1">
<p>
在现有工作基础上，收集客户反馈和需求。
进行新功能开发和已有功能改进优化。
</p>
<ul class="org-ul">
<li>IAM
<ul class="org-ul">
<li>统一登出
</li>
<li>第三方帐号登录
</li>
<li>现有功能改进和优化
<ul class="org-ul">
<li>UI
</li>
<li>Benckend
</li>
<li>DevOps
</li>
</ul>
</li>
</ul>
</li>

<li>API gateway
<ul class="org-ul">
<li>流量控制
</li>
<li>API访问日志
</li>
<li>kong和插件的版本升级迁移
</li>
</ul>
</li>

<li>license
<ul class="org-ul">
<li>加密算法升级
</li>
<li>license SDK 支持动态链接库的集成方式
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 产品推广以及和业务线集成</h3>
<div class="outline-text-3" id="text-1-2">
<p>
和业务线紧密合作，推动产品线和商汤云框架的对接和集成, 加速商汤云框架的落地和应用。
包含但不限于以下产品线
</p>
<ul class="org-ul">
<li>Evoa
</li>
<li>Sensestudio
</li>
<li>SenselinkGE
</li>
<li>Sensecare
</li>
</ul>

<p>
为了提高集成的效率和质量
</p>
<ul class="org-ul">
<li>完善对接流程文档
</li>
<li>提供类生产环境的集成环境和示例应用
</li>
<li>提供测试验证工具
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 产品部署交付</h3>
<div class="outline-text-3" id="text-1-3">
<p>
商汤云框架的部署交付。根据实际需求排期，会在下面的区域进行IAM/API Gateway的部署实施。
</p>
<ul class="org-ul">
<li>SkyICT
</li>
<li>JCV
</li>
</ul>

<p>
为了提高部署的效率和后续运维质量，
</p>
<ul class="org-ul">
<li>完善日志和监控报警定义
</li>
<li>提供自动巡检功能
</li>
<li>版本升级，数据迁移技术验证和演练
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 内部集成优化</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>商汤云框架和license系统之间的集成方式
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Q3 WorkItem</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> IAM</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> 新功能</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
统一登出
第三方帐号登录
log metrics
</p>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> 已有功能改进</h4>
<div class="outline-text-4" id="text-2-1-2">
</div><ol class="org-ol"><li><a id="sec-2-1-2-1" name="sec-2-1-2-1"></a>用户管理<br ></li>

<li><a id="sec-2-1-2-2" name="sec-2-1-2-2"></a>rs管理<br ><div class="outline-text-5" id="text-2-1-2-2">
<ul class="org-ul">
<li>WebUI: 配置管理
</li>

<li>OpenAPI: CRUD
<ul class="org-ul">
<li>创建：
baseurl
internal<sub>url</sub>

<p>
baseurl 的格式必须固定，并且和yaml的版本号一致
</p>
</li>

<li>更新
哪些字段能够更新？？！！ 只能更新openapi.yaml
</li>

<li>删除
没有access key
并且gateway被undeploy了
</li>
</ul>
</li>
</ul>
</div>
</li>

<li><a id="sec-2-1-2-3" name="sec-2-1-2-3"></a>metrics 定义和收集<br ><div class="outline-text-5" id="text-2-1-2-3">
<p>
cache
</p>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> API Gateway</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Nginx和Openresty的原理机制</h4>
</div>
<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Kong插件开发流程</h4>
</div>
<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> kong docker image 打包过程和配置</h4>
</div>

<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> 常见组件</h4>
<div class="outline-text-4" id="text-2-2-4">
<p>
nokia-oidc
openidc
session
redis-cluster
</p>
</div>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> DevOps</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Build
Release
Run
</p>
</div>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: zhou mingjun</p>
<<<<<<< HEAD
<p class="date">Created: 2020-07-06 Mon 11:02</p>
=======
<p class="date">Created: 2020-07-04 Sat 14:44</p>
>>>>>>> 50fef871450b68c27b650ddc17389c7f974a1e49
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="http://orgmode.org">Org-mode</a> 9.4)</p>
</div>
</footer>
</body>
</html>
